#### Week 2 Data Analysis with Pandas


# Lesson 3: Writing Functions

Project Challenges: Names Dataset

Write a function parse_dataset(year) that helps you work with the data.

The function should:

* accept a single year as input value
* construct a valid file path
* read in the corresponding names dataset
* define the correct column index for the data set
* output the dataset as a pandas dataframe

Example: Calling the function with parse_dataset(year=1880) should return:

Tips:

* First develop the code in a cell of a Jupyter notebook
* Start by defining a year variable year=1880
* Test the code on a few text lines only
* If everything works wrap the code into a function

In [2]:
import pandas as pd

In [5]:
df_1880 = pd.read_csv('df_yob1880.csv')

In [6]:
df_1880.head()

        name gender  frequency
0       Mary      F       7065
1       Anna      F       2604
2       Emma      F       2003
3  Elizabeth      F       1939
4     Minnie      F       1746

In [19]:
year = 1983

path = f"yob{year}.txt"

In [20]:
print(path)

yob1983.txt

In [21]:
year_1983 = pd.read_csv(path)

In [22]:
year_1983

       Jennifer  F  54349
0       Jessica  F  45280
1        Amanda  F  33755
2        Ashley  F  33296
3         Sarah  F  27232
4       Melissa  F  23474
...         ... ..    ...
19406  Zebediah  M      5
19407   Zebulan  M      5
19408       Zef  M      5
19409     Zenas  M      5
19410     Zoran  M      5

[19411 rows x 3 columns]

In [23]:
year_1983 = pd.read_csv(path, names = ["name", "gender", "frequency"])

In [24]:
year_1983

           name gender  frequency
0      Jennifer      F      54349
1       Jessica      F      45280
2        Amanda      F      33755
3        Ashley      F      33296
4         Sarah      F      27232
...         ...    ...        ...
19407  Zebediah      M          5
19408   Zebulan      M          5
19409       Zef      M          5
19410     Zenas      M          5
19411     Zoran      M          5

[19412 rows x 3 columns]

In [25]:
def parse_dataset(year):
    path = f"yob{year}.txt"
    year_specific_data = pd.read_csv(path, names = ["name", "gender", "frequency"])
    
    return year_1983

In [26]:
year = 1983

In [27]:

parse_dataset(year)

           name gender  frequency
0      Jennifer      F      54349
1       Jessica      F      45280
2        Amanda      F      33755
3        Ashley      F      33296
4         Sarah      F      27232
...         ...    ...        ...
19407  Zebediah      M          5
19408   Zebulan      M          5
19409       Zef      M          5
19410     Zenas      M          5
19411     Zoran      M          5

[19412 rows x 3 columns]